### Import Data

In [1]:
import pandas as pd

In [2]:
sales_path = "/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 8 Wide and Narrow Data/Data8/sales_by_employee.csv"

In [3]:
df_sales = pd.read_csv(sales_path, parse_dates=['Date'])
print(df_sales.head())

        Date   Name       Customer  Revenue  Expenses
0 2020-01-01  Oscar  Logistics XYZ     5250       531
1 2020-01-01  Oscar    Money Corp.     4406       661
2 2020-01-02  Oscar     PaperMaven     8661      1401
3 2020-01-03  Oscar    PaperGenius     7075       906
4 2020-01-04  Oscar    Paper Pound     2524      1767

/var/folders/pg/x6kyk1l92fj8q4332g1j8rnw0000gp/T/ipykernel_63950/3130922123.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_sales = pd.read_csv(sales_path, parse_dates=['Date'])

### Pivot Table

In [4]:
df_sales.nunique()

Date         5
Name         5
Customer     7
Revenue     26
Expenses    26
dtype: int64

In [5]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      26 non-null     datetime64[ns]
 1   Name      26 non-null     object
 2   Customer  26 non-null     object
 3   Revenue   26 non-null     int64
 4   Expenses  26 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 1.1+ KB

**If your dataframe includes an object type of column, point out specific columns**

In [6]:
df_sales.pivot_table(index="Date", values=['Revenue','Expenses'])

               Expenses      Revenue
Date
2020-01-01   637.500000  4293.500000
2020-01-02  1244.400000  7303.000000
2020-01-03  1313.666667  4865.833333
2020-01-04  1450.600000  3948.000000
2020-01-05  1196.250000  4834.750000

**Identify operation**

In [7]:
df_sales.pivot_table(index="Date", values=['Revenue','Expenses'], aggfunc='mean')

               Expenses      Revenue
Date
2020-01-01   637.500000  4293.500000
2020-01-02  1244.400000  7303.000000
2020-01-03  1313.666667  4865.833333
2020-01-04  1450.600000  3948.000000
2020-01-05  1196.250000  4834.750000

In [8]:
df_sales.pivot_table(index="Date", values=['Revenue','Expenses'], aggfunc='sum')

            Expenses  Revenue
Date
2020-01-01      3825    25761
2020-01-02      6222    36515
2020-01-03      7882    29195
2020-01-04      7253    19740
2020-01-05      4785    19339

**Create pivot table using columns**

In [9]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='sum'))

Name          Creed   Dwight     Jim  Michael   Oscar
Date
2020-01-01   4430.0   2639.0  1864.0   7172.0  9656.0
2020-01-02  13214.0      NaN  8278.0   6362.0  8661.0
2020-01-03      NaN  11912.0  4226.0   5982.0  7075.0
2020-01-04   3144.0      NaN  6155.0   7917.0  2524.0
2020-01-05    938.0   7771.0     NaN   7837.0  2793.0

**Replace NaN with fill_value=0**

In [10]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='sum', fill_value=0))

Name        Creed  Dwight   Jim  Michael  Oscar
Date
2020-01-01   4430    2639  1864     7172   9656
2020-01-02  13214       0  8278     6362   8661
2020-01-03      0   11912  4226     5982   7075
2020-01-04   3144       0  6155     7917   2524
2020-01-05    938    7771     0     7837   2793

**Summarize outcomes with margins=True**

In [11]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='sum', fill_value=0, margins=True))

Name                 Creed  Dwight    Jim  Michael  Oscar     All
Date
2020-01-01 00:00:00   4430    2639   1864     7172   9656   25761
2020-01-02 00:00:00  13214       0   8278     6362   8661   36515
2020-01-03 00:00:00      0   11912   4226     5982   7075   29195
2020-01-04 00:00:00   3144       0   6155     7917   2524   19740
2020-01-05 00:00:00    938    7771      0     7837   2793   19339
All                  21726   22322  20523    35270  30709  130550

**Summarize outcomes with margins=Total**

In [12]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='sum', fill_value=0, margins='Total'))

Name                 Creed  Dwight    Jim  Michael  Oscar     All
Date
2020-01-01 00:00:00   4430    2639   1864     7172   9656   25761
2020-01-02 00:00:00  13214       0   8278     6362   8661   36515
2020-01-03 00:00:00      0   11912   4226     5982   7075   29195
2020-01-04 00:00:00   3144       0   6155     7917   2524   19740
2020-01-05 00:00:00    938    7771      0     7837   2793   19339
All                  21726   22322  20523    35270  30709  130550

### Additional Options for Pivot Tables

**Count employee sales**

In [13]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc='count', fill_value=0))

Name        Creed  Dwight  Jim  Michael  Oscar
Date
2020-01-01      1       1    1        1      2
2020-01-02      2       0    1        1      1
2020-01-03      0       3    1        1      1
2020-01-04      1       0    2        1      1
2020-01-05      1       1    0        1      1

**Use two operations**

In [14]:
print(df_sales.pivot_table(index="Date",columns='Name', values='Revenue', aggfunc=['count','sum'], fill_value=0))

           count                             sum
Name       Creed Dwight Jim Michael Oscar  Creed Dwight   Jim Michael Oscar
Date
2020-01-01     1      1   1       1     2   4430   2639  1864    7172  9656
2020-01-02     2      0   1       1     1  13214      0  8278    6362  8661
2020-01-03     0      3   1       1     1      0  11912  4226    5982  7075
2020-01-04     1      0   2       1     1   3144      0  6155    7917  2524
2020-01-05     1      1   0       1     1    938   7771     0    7837  2793

**Different operations in different columns**

In [15]:
print(df_sales.pivot_table(index="Date",columns='Name', values=['Expenses','Revenue'], aggfunc={'Expenses': 'max', 'Revenue': 'min'}, fill_value=0))

           Expenses                            Revenue                       \
Name          Creed Dwight   Jim Michael Oscar   Creed Dwight   Jim Michael
Date
2020-01-01      548    368  1305     412   661    4430   2639  1864    7172
2020-01-02     1906      0   462     685  1401    5188      0  8278    6362
2020-01-03        0   1321  1923    1772   906       0   2703  4226    5982
2020-01-04     1314      0  1889    1857  1767    3144      0  2287    7917
2020-01-05     1053   1475     0    1633   624     938   7771     0    7837


Name       Oscar
Date
2020-01-01  4406
2020-01-02  8661
2020-01-03  7075
2020-01-04  2524
2020-01-05  2793

In [16]:
df_sales.pivot_table(index="Date",columns='Name', values=['Expenses','Revenue'], aggfunc={'Expenses': 'max', 'Revenue': 'min'}, fill_value=0)

           Expenses                            Revenue                       \
Name          Creed Dwight   Jim Michael Oscar   Creed Dwight   Jim Michael
Date
2020-01-01      548    368  1305     412   661    4430   2639  1864    7172
2020-01-02     1906      0   462     685  1401    5188      0  8278    6362
2020-01-03        0   1321  1923    1772   906       0   2703  4226    5982
2020-01-04     1314      0  1889    1857  1767    3144      0  2287    7917
2020-01-05     1053   1475     0    1633   624     938   7771     0    7837


Name       Oscar
Date
2020-01-01  4406
2020-01-02  8661
2020-01-03  7075
2020-01-04  2524
2020-01-05  2793

**Use multiIndex**

In [17]:
print(df_sales.pivot_table(index=["Name", "Date"], values="Revenue", aggfunc="sum").head(10))

                   Revenue
Name   Date
Creed  2020-01-01     4430
       2020-01-02    13214
       2020-01-04     3144
       2020-01-05      938
Dwight 2020-01-01     2639
       2020-01-03    11912
       2020-01-05     7771
Jim    2020-01-01     1864
       2020-01-02     8278
       2020-01-03     4226

**Replace levels**

In [18]:
print(df_sales.pivot_table(index=["Date", "Name"], values="Revenue", aggfunc="sum").head(10))

                    Revenue
Date       Name
2020-01-01 Creed       4430
           Dwight      2639
           Jim         1864
           Michael     7172
           Oscar       9656
2020-01-02 Creed      13214
           Jim         8278
           Michael     6362
           Oscar       8661
2020-01-03 Dwight     11912

### Stacking and Unstacking Index Levels

In [19]:
by_name_and_date = df_sales.pivot_table(index="Name", columns = 'Date', values="Revenue", aggfunc="sum", fill_value=0)

In [20]:
print(by_name_and_date.head())

Date     2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05
Name
Creed          4430       13214           0        3144         938
Dwight         2639           0       11912           0        7771
Jim            1864        8278        4226        6155           0
Michael        7172        6362        5982        7917        7837
Oscar          9656        8661        7075        2524        2793

**Change axis for index using Stack()**

In [21]:
print(by_name_and_date.stack().head(10))

Name    Date
Creed   2020-01-01     4430
        2020-01-02    13214
        2020-01-03        0
        2020-01-04     3144
        2020-01-05      938
Dwight  2020-01-01     2639
        2020-01-02        0
        2020-01-03    11912
        2020-01-04        0
        2020-01-05     7771
dtype: int64

**Change axis for index using Unstack()**

In [23]:
sales_by_customer = df_sales.pivot_table(
index = ["Customer", "Name"],
values = "Revenue",
aggfunc = "sum",
fill_value=0
)

In [24]:
print(sales_by_customer.head(10))

                           Revenue
Customer          Name
Average Paper Co. Creed      13214
                  Jim         2287
Best Paper Co.    Dwight      2703
                  Michael    15754
Logistics XYZ     Dwight      9209
                  Michael     7172
                  Oscar       5250
Money Corp.       Creed       5368
                  Jim         8278
                  Oscar       4406

In [25]:
print(sales_by_customer.unstack().head(10))

                   Revenue
Name                 Creed  Dwight     Jim  Michael   Oscar
Customer
Average Paper Co.  13214.0     NaN  2287.0      NaN     NaN
Best Paper Co.         NaN  2703.0     NaN  15754.0     NaN
Logistics XYZ          NaN  9209.0     NaN   7172.0  5250.0
Money Corp.         5368.0     NaN  8278.0      NaN  4406.0
Paper Pound            NaN  7771.0  4226.0      NaN  5317.0
PaperGenius            NaN  2639.0  1864.0  12344.0  7075.0
PaperMaven          3144.0     NaN  3868.0      NaN  8661.0

### Melting a Data Set

In [28]:
vg_sales_path = '/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 8 Wide and Narrow Data/Data8/video_game_sales.csv'

In [29]:
df_vg_sales = pd.read_csv(vg_sales_path)
print(df_vg_sales.head())

                       Name     NA     EU     JP  Other
0                Wii Sports  41.49  29.02   3.77   8.46
1         Super Mario Bros.  29.08   3.58   6.81   0.77
2            Mario Kart Wii  15.85  12.88   3.79   3.31
3         Wii Sports Resort  15.75  11.01   3.28   2.96
4  Pokemon Red/Pokemon Blue  11.27   8.89  10.22   1.00

**Melt function**

In [31]:
df_vg_sales.melt(id_vars = 'Name', value_vars='NA').head()

                       Name variable  value
0                Wii Sports       NA  41.49
1         Super Mario Bros.       NA  29.08
2            Mario Kart Wii       NA  15.85
3         Wii Sports Resort       NA  15.75
4  Pokemon Red/Pokemon Blue       NA  11.27

In [32]:
regional_sales_columns = ["NA", "EU", "JP", "Other"]

In [36]:
print(df_vg_sales.melt(id_vars = 'Name', value_vars=regional_sales_columns))

                                                   Name variable  value
0                                            Wii Sports       NA  41.49
1                                     Super Mario Bros.       NA  29.08
2                                        Mario Kart Wii       NA  15.85
3                                     Wii Sports Resort       NA  15.75
4                              Pokemon Red/Pokemon Blue       NA  11.27
...                                                 ...      ...    ...
66259                Woody Woodpecker in Crazy Castle 5    Other   0.00
66260                     Men in Black II: Alien Escape    Other   0.00
66261  SCORE International Baja 1000: The Official Game    Other   0.00
66262                                        Know How 2    Other   0.00
66263                                  Spirits & Spells    Other   0.00

[66264 rows x 3 columns]

**Change names for new columns**

In [39]:
vg_sales_by_region = df_vg_sales.melt(id_vars = 'Name',var_name='Region', value_name='Sales', value_vars=regional_sales_columns)
print(vg_sales_by_region)

                                                   Name Region  Sales
0                                            Wii Sports     NA  41.49
1                                     Super Mario Bros.     NA  29.08
2                                        Mario Kart Wii     NA  15.85
3                                     Wii Sports Resort     NA  15.75
4                              Pokemon Red/Pokemon Blue     NA  11.27
...                                                 ...    ...    ...
66259                Woody Woodpecker in Crazy Castle 5  Other   0.00
66260                     Men in Black II: Alien Escape  Other   0.00
66261  SCORE International Baja 1000: The Official Game  Other   0.00
66262                                        Know How 2  Other   0.00
66263                                  Spirits & Spells  Other   0.00

[66264 rows x 3 columns]

In [43]:
vg_sales_by_region.pivot_table(index='Name', values='Sales', aggfunc='sum', fill_value=0)

                               Sales
Name
'98 Koshien                     0.40
.hack//G.U. Vol.1//Rebirth      0.17
.hack//G.U. Vol.2//Reminisce    0.23
.hack//G.U. Vol.3//Redemption   0.17
.hack//Infection Part 1         1.26
...                              ...
thinkSMART FAMILY!              0.03
thinkSMART: Chess for Kids      0.01
uDraw Studio                    2.45
uDraw Studio: Instant Artist    0.21
¡Shin Chan Flipa en colores!    0.14

[11462 rows x 1 columns]

### Exploding a List of Values

In [44]:
recipes_path = '/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 8 Wide and Narrow Data/Data8/recipes.csv'

**We have a string with many items included in one value**

In [45]:
df_recipes = pd.read_csv(recipes_path)
print(df_recipes.head())

                    Recipe                                        Ingredients
0   Cashew Crusted Chicken  Apricot preserves, Dijon mustard, curry powder...
1      Tomato Basil Salmon  Salmon filets, basil, tomato, olive oil, Parme...
2  Parmesan Cheese Chicken  Bread crumbs, Parmesan cheese, Italian seasoni...

**create a list with different values**

In [47]:
print(df_recipes["Ingredients"].str.split(","))

0    [Apricot preserves,  Dijon mustard,  curry pow...
1    [Salmon filets,  basil,  tomato,  olive oil,  ...
2    [Bread crumbs,  Parmesan cheese,  Italian seas...
Name: Ingredients, dtype: object

In [48]:
df_recipes['Ingredients'] = df_recipes['Ingredients'].str.split(",")
print(df_recipes.head())

                    Recipe                                        Ingredients
0   Cashew Crusted Chicken  [Apricot preserves,  Dijon mustard,  curry pow...
1      Tomato Basil Salmon  [Salmon filets,  basil,  tomato,  olive oil,  ...
2  Parmesan Cheese Chicken  [Bread crumbs,  Parmesan cheese,  Italian seas...

**Devide values for each Recipe**

In [51]:
df_items = df_recipes.explode('Ingredients')

In [52]:
df_items.head()

                   Recipe        Ingredients
0  Cashew Crusted Chicken  Apricot preserves
0  Cashew Crusted Chicken      Dijon mustard
0  Cashew Crusted Chicken       curry powder
0  Cashew Crusted Chicken    chicken breasts
0  Cashew Crusted Chicken            cashews

In [53]:
df_items.nunique()

Recipe          3
Ingredients    13
dtype: int64

### Task

In [59]:
cars_path = '/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 8 Wide and Narrow Data/Data8/used_cars.csv'
min_wage_path = '/Users/ypushiev/Learning/PANDAS IN ACTION/Chapter 8 Wide and Narrow Data/Data8/minimum_wage.csv'

In [60]:
df_cars = pd.read_csv(cars_path)
df_min_wage = pd.read_csv(min_wage_path)

In [65]:
df_cars.nunique()

Manufacturer       41
Year               21
Fuel                5
Transmission        3
Price           18103
dtype: int64

In [61]:
df_cars.head()

  Manufacturer  Year Fuel Transmission  Price
0        Acura  2012  Gas    Automatic  10299
1       Jaguar  2011  Gas    Automatic   9500
2        Honda  2004  Gas    Automatic   3995
3    Chevrolet  2016  Gas    Automatic  41988
4          Kia  2015  Gas    Automatic  12995

**Aggregate prices of cars. Group results by type fuel along the line axis.**

In [82]:
df_cars.pivot_table(index='Fuel', values='Price', aggfunc='sum', fill_value=0)

                Price
Fuel
Diesel      986177143
Electric     18502957
Gas       86203853926
Hybrid       44926064
Other       242096286

**Aggregate the number of cars in the cars. Group the results according to the driver on the line axis and gearbox type on the column axis.**

In [83]:
df_cars.pivot_table(index='Manufacturer', columns = 'Transmission', values='Price', aggfunc='count', fill_value=0, margins=True )

Transmission     Automatic  Manual  Other     All
Manufacturer
Acura                 3443     141     48    3632
Alfa-Romeo              50       0     11      61
Aston-Martin            20       5      0      25
Audi                  4974     375     69    5418
BMW                  11641     774    627   13042
Buick                 6187      17    265    6469
Cadillac              6357      74    406    6837
Chevrolet            61006    1820   4255   67081
Chrysler              7553     133    212    7898
Dodge                14338     626    991   15955
Ferrari                 29       4      9      42
Fiat                   435     220    187     842
Ford                 75980    2979   3505   82464
GMC                  19504     137    939   20580
Harley-Davidson        115      61     10     186
Hennessey                0       1      0       1
Honda                20666    1502    921   23089
Hyundai              10350     544    334   11228
Infiniti              3555     185     76    3816
Jaguar                 882      29     50     961
Jeep                 17687    2316   1385   21388
Kia                   7615     466    587    8668
Land Rover              23       0      0      23
Lexus                 5573      30    226    5829
Lincoln               3001      10     51    3062
Mazda                 4127     746    649    5522
Mercedes-Benz         9599      74     98    9771
Mercury               1437      15      2    1454
Mini                  1411     712    138    2261
Mitsubishi            2064     247     52    2363
Nissan               22262     858   1429   24549
Pontiac               2710     213     28    2951
Porche                   9       1      0      10
Ram                  19996     837   1243   22076
Rover                 1752       9     24    1785
Saturn                1451     152     12    1615
Subaru                8317    1884    420   10621
Tesla                  179       0     59     238
Toyota               31480    1367   2134   34981
Volkswagen            7985    1286    236    9507
Volvo                 2665     155     50    2870
All                 398428   21005  21738  441171

**Aggregate the average price of cars. Group results by year and the fuel type on the line axis, and the gearbox type on the column axis.**

In [81]:
df_cars.pivot_table(index=['Year','Fuel'], columns='Transmission', values='Price', aggfunc='mean', fill_value=0)

Transmission      Automatic        Manual         Other
Year Fuel
2000 Diesel    11326.176962  14010.164021  11075.000000
     Electric   1500.000000      0.000000      0.000000
     Gas        4314.675996   6226.140327   3203.538462
     Hybrid     2600.000000   2400.000000      0.000000
     Other     16014.918919  11361.952381  12984.642857
...                     ...           ...           ...
2020 Diesel    63272.595930      1.000000   1234.000000
     Electric   8015.166667   2200.000000  20247.500000
     Gas       34925.857933  36007.270833  20971.045455
     Hybrid    35753.200000      0.000000   1234.000000
     Other     22210.306452      0.000000   2725.925926

[102 rows x 3 columns]

**DataFrame object from previous task transfers level Transmission from the column axis to the line axis.**

In [86]:
report = df_cars.pivot_table(
values = "Price",
index = ["Year", "Fuel"],
columns = ["Transmission"],
aggfunc = "mean"
)

In [90]:
print(report.stack())

Year  Fuel      Transmission
2000  Diesel    Automatic       11326.176962
                Manual          14010.164021
                Other           11075.000000
      Electric  Automatic        1500.000000
      Gas       Automatic        4314.675996
                                    ...
2020  Gas       Other           20971.045455
      Hybrid    Automatic       35753.200000
                Other            1234.000000
      Other     Automatic       22210.306452
                Other            2725.925926
Length: 274, dtype: float64

**Convert min_wage from wide to narrow. Other Translate the data from eight columns of years (from 2010 to 2017) in one column.**

In [92]:
df_min_wage.head()

        State  2010  2011  2012  2013  2014  2015   2016   2017
0     Alabama  0.00  0.00  0.00  0.00  0.00  0.00   0.00   0.00
1      Alaska  8.90  8.63  8.45  8.33  8.20  9.24  10.17  10.01
2     Arizona  8.33  8.18  8.34  8.38  8.36  8.50   8.40  10.22
3    Arkansas  7.18  6.96  6.82  6.72  6.61  7.92   8.35   8.68
4  California  9.19  8.91  8.72  8.60  9.52  9.51  10.43  10.22

In [91]:
Years = ["2010", "2011", "2012", "2013","2014", "2015", "2016", "2017"]

In [94]:
df_min_wage.melt(id_vars='State', value_vars=Years, var_name='Year', value_name='Wage')

             State  Year   Wage
0          Alabama  2010   0.00
1           Alaska  2010   8.90
2          Arizona  2010   8.33
3         Arkansas  2010   7.18
4       California  2010   9.19
..             ...   ...    ...
435       Virginia  2017   7.41
436     Washington  2017  11.24
437  West Virginia  2017   8.94
438      Wisconsin  2017   7.41
439        Wyoming  2017   5.26

[440 rows x 3 columns]